## Рекурсия

1. Нерекурсивная ветвь
2. Рекурсивная ветвь
подпрограммы:
1. процедуры
2. функции

```pascal
procedure имя(параметры);
раздел описания
begin
операторы
end;
```

```pascal
function имя(параметры): тип возвращаемого значения
```

Написать программу вычисления функции заданной при n >= 1 следующим образом:

f(n) =
{1, n = 1
{f(n/2), n>1 и n - четное
{f(n/2) + f(n/2 + 1), n > 1 и n - нечетное

```pascal
var n,a: integer;
function f(n:integer):integer;
begin
 if(n = 1) then f := 1;
 else 
  begin 
   if (n mod 2 = 0) then 
    begin
     n:= n div 2;
     f:= f(n);
    end
  else
  begin
   n := n div 2;
   f:= f(n) + f(n+1);
   end;
  end;
 end;



begin
 readln(n);
 a:=f(n);
 write(a);
end
 
```